src/DataProcessors/КонсольЗапросов/КонсольЗапросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КонсольЗапросов</name>
  <attributes>
    <name>АвтосохранениеПриЗакрытии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВосстанавливатьРезультатЗапросаПриАктивизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьКолонкуУИДДляСсылочныхТипов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВыводитьВременныеТаблицы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <comment>Имя файла XML, где хранятся запросы и параметры.</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФормам</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>700</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбхода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Запросы</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресРезультатаЗапроса</name>
      <comment>Адрес результата запроса во временном  хранилище</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторЗапроса</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/DataProcessors/КонсольЗапросов/Forms/ТекстЗапросаДляКонфигуратора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Текст = Параметры.ТекстЗапроса;
	ПараметрыЗапроса = Параметры.Параметры;
	//ТекстЗапроса.УстановитьТекст(СформироватьТекстЗапросаДляКонфигуратора(Текст));
	ТекстЗапроса.УстановитьФорматированнуюСтроку(ПолучитьРаскрашенныйТекст(СформироватьТекстЗапросаДляКонфигуратора(Текст)));
КонецПроцедуры

&НаСервере
Функция СформироватьТекстЗапросаДляКонфигуратора(Текст)

	ВозврЗнач = "Запрос = Новый Запрос;
	|Запрос.Текст =
	|""";
	ПереводСтроки = Символы.ВК+Символы.ПС;
	Для Счетчик = 1 По СтрЧислоСтрок(Текст) Цикл
		ТекСтрока = СтрПолучитьСтроку(Текст, Счетчик);
		Если Счетчик > 1 Тогда 
			ТекСтрока = СтрЗаменить(ТекСтрока,"""","""""");
			ВозврЗнач = ВозврЗнач + ПереводСтроки + "|"+ ТекСтрока;
		Иначе	
			ТекСтрока = СтрЗаменить(ТекСтрока,"""","""""");
			ВозврЗнач = ВозврЗнач + ТекСтрока;
		КонецЕсли;	
	КонецЦикла;
	ВозврЗнач = ВозврЗнач + """;
	|
	|";
	
	Для Каждого стрПараметр Из ПараметрыЗапроса Цикл
		ВозврЗнач = ВозврЗнач + "Запрос.УстановитьПараметр(""" + стрПараметр.Значение.Имя + """, " + стрПараметр.Значение.Значение + ");
		|";
	КонецЦикла;
	
	ВозврЗнач = ВозврЗнач + "
	|Результат = Запрос.Выполнить();
	|Выборка = Результат.Выбрать();
	|
	|Пока Выборка.Следующий() Цикл
	|
	|	
	|
	|КонецЦикла;";
	
	Возврат ВозврЗнач;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПодсветкуСинтаксиса(Команда)
	ТекстЗапроса.УстановитьФорматированнуюСтроку(ПолучитьРаскрашенныйТекст(ТекстЗапроса.ПолучитьТекст()));
КонецПроцедуры


#Область Раскраска
Функция ПолучитьРаскрашенныйТекст(Знач ТЗ) Экспорт 

	Цвет_КлючевыеСлова = WebЦвета.Красный;
	Цвет_Функции = WebЦвета.ТемноБордовый;
	Цвет_Комментарии = WebЦвета.Зеленый;
	Цвет_Параметр = WebЦвета.ЦианНейтральный;
	Цвет_Число = WebЦвета.Черный;
	Цвет_Текст = WebЦвета.Синий;
	
	СимволыНПП = Символы.НПП;
	
	ТЗ = СтрЗаменить(ТЗ, Символы.Таб, "    ");
	ТЗ = СтрЗаменить(ТЗ, СимволыНПП, " ");
	МассивФМС = Новый Массив;
	
	МассивСтрок = ИзСтрокиСРазделителями(ТЗ, Символы.ПС);
	КолСтрок = МассивСтрок.Количество();
	Для индСтрока = 0 По КолСтрок - 1 Цикл
		
		стрСтрока = МассивСтрок[индСтрока];
		
		Если Лев(СокрЛ(стрСтрока), 2)	= "//" Тогда
			МассивФМС.Добавить(Новый Структура("Строка, Цвет", стрСтрока, Цвет_Комментарии));
		ИначеЕсли Лев(СокрЛ(стрСтрока), 1)	= "|" И Прав(СокрП(стрСтрока),2) <> """;" Тогда
			МассивФМС.Добавить(Новый Структура("Строка, Цвет", стрСтрока, Цвет_Число));
		Иначе
			ПроверяемаяСтрока = ВРег(стрСтрока);
			
			МассивСлов = ПолучитьСписокСлов(стрСтрока);
			КолСлов = МассивСлов.Количество();
			Для индСлово = 0 По КолСлов - 1 Цикл
				
				стрСлово = МассивСлов[индСлово];
				
				Если ТипЗнч(стрСлово) = Тип("Структура") Тогда
					МассивФМС.Добавить(стрСлово);
					Продолжить;
				КонецЕсли;
				
				ПроверяемоеСлово = ВРег(стрСлово);
				
				Если форматирование_ЭтоКлючевоеСлово(ПроверяемоеСлово) Тогда
					МассивФМС.Добавить(Новый Структура("Строка, Цвет", стрСлово, Цвет_КлючевыеСлова));
				ИначеЕсли форматирование_ЭтоЧисло(стрСлово) Тогда
					МассивФМС.Добавить(Новый Структура("Строка, Цвет", стрСлово, Цвет_Число));
				Иначе  
					МассивФМС.Добавить(Новый Структура("Строка, Цвет", стрСлово, Цвет_Текст));
				КонецЕсли; 
				
			КонецЦикла;
			
		КонецЕсли; 
		
		Если индСтрока < КолСтрок - 1 Тогда
			МассивФМС.Добавить(Новый Структура("Строка, Цвет", Символы.ПС, ""));
		КонецЕсли; 
		
	КонецЦикла; 
	
	Если МассивФМС.Количество() = 0 Тогда
		Возврат Новый ФорматированнаяСтрока("");
	КонецЕсли;
	
	ФМС_Строка = "";
	Цвет_Текст = WebЦвета.Черный;
	ПредЦвет = МассивФМС[0].Цвет;
	Если ПредЦвет = "" Тогда
		ПредЦвет = Цвет_Текст;
	КонецЕсли;
	ФМС = Новый ФорматированнаяСтрока("");
	МассивФМСРез= Новый Массив;
	
	Для Каждого стрСлово Из МассивФМС Цикл
		Если стрСлово.Цвет = "" ИЛИ ПредЦвет = стрСлово.Цвет Тогда
			//Если стрСлово.Строка = Символы.ПС Тогда
			//	Если ПредЦвет = Цвет_Текст Тогда
			//		МассивФМСРез.Добавить(ФМС_Строка);
			//	Иначе
			//		МассивФМСРез.Добавить(Новый ФорматированнаяСтрока(ФМС_Строка,,ПредЦвет));
			//	КонецЕсли;
			//	
			//	ФМС_Строка = стрСлово.Строка;
			//	ПредЦвет = Цвет_Текст;
			//Иначе
				ФМС_Строка = ФМС_Строка + стрСлово.Строка;	
			//КонецЕсли;
		Иначе
			Если ПредЦвет = Цвет_Текст Тогда
				МассивФМСРез.Добавить(ФМС_Строка);
			Иначе
				МассивФМСРез.Добавить(Новый ФорматированнаяСтрока(ФМС_Строка,,ПредЦвет));
			КонецЕсли;
			
			ФМС_Строка = стрСлово.Строка;
			ПредЦвет = стрСлово.Цвет;
		КонецЕсли; 
	КонецЦикла;
	Если ПредЦвет = Цвет_Текст Тогда
		МассивФМСРез.Добавить(ФМС_Строка);
	Иначе
		МассивФМСРез.Добавить(Новый ФорматированнаяСтрока(ФМС_Строка,,ПредЦвет));
	КонецЕсли;
	
	Возврат Новый ФорматированнаяСтрока(МассивФМСРез);
	
	//ввв= "";
	//ТекстЗапроса_ТД.ПолучитьHTML(ввв, Неопределено);	

КонецФункции

Функция ИзСтрокиСРазделителями(Знач вхСтр, вхРазделитель)
	
	Массив = Новый Массив;
	вхСтр = СтрЗаменить(вхСтр, вхРазделитель, Символы.ПС);
	ЧислоСтрок = СтрЧислоСтрок(вхСтр);
	Для Счетчик = 1 По ЧислоСтрок Цикл 
		Массив.Добавить(СтрПолучитьСтроку(вхСтр, Счетчик));
	КонецЦикла;
	Возврат Массив;
	
КонецФункции

Функция ПолучитьСписокСлов(Знач вхСтр)
	
	Цвет_КлючевыеСлова = WebЦвета.Красный;
	Цвет_Строка = WebЦвета.Черный;
	
	МассивРезультат = Новый Массив;
	
	ТекущееСлово = "";
	СтрДлинаСтр = СтрДлина(вхСтр);
	
	Для Поз = 1 По СтрДлинаСтр Цикл
		ТекущийСимвол = Сред(вхСтр, Поз, 1);
		
		Если ТекущийСимвол = " " Тогда
			
			Если ЗначениеЗаполнено(ТекущееСлово) Тогда
				МассивРезультат.Добавить(ТекущееСлово);
				ТекущееСлово = "";
			КонецЕсли;
			
			Пока ТекущийСимвол = " " и Поз <= СтрДлинаСтр Цикл
				ТекущееСлово = ТекущееСлово + Символы.НПП;
				Поз = Поз + 1;
				ТекущийСимвол = Сред(вхСтр, Поз, 1);
			КонецЦикла;
			МассивРезультат.Добавить(Новый Структура("Строка, Цвет", ТекущееСлово, ""));
			
			ТекущееСлово = "";
			
		КонецЕсли;
			
		Если Найти(",();=+-*<>'", ТекущийСимвол) > 0 Тогда
			
			Если ЗначениеЗаполнено(ТекущееСлово) Тогда
				МассивРезультат.Добавить(ТекущееСлово);
			КонецЕсли;
			
			Если ТекущийСимвол = ">" Тогда
				МассивРезультат.Добавить(Новый Структура("Строка, Цвет", "&gt;", Цвет_КлючевыеСлова));  //Баг платформы
			Иначе
				МассивРезультат.Добавить(Новый Структура("Строка, Цвет", ТекущийСимвол, Цвет_КлючевыеСлова));
			КонецЕсли; 
			
			ТекущееСлово = "";
			
		ИначеЕсли ТекущийСимвол = """" ИЛИ  ТекущийСимвол = "|" Тогда
			
			Если ЗначениеЗаполнено(ТекущееСлово) Тогда
				МассивРезультат.Добавить(ТекущееСлово);
			КонецЕсли;
			
			ТекущееСлово = ТекущийСимвол;
			Поз = Поз + 1;
			ТекущийСимвол = Сред(вхСтр, Поз, 1);

			Пока ТекущийСимвол <> "|" и ТекущийСимвол <> """" и Поз <= СтрДлинаСтр Цикл
				ТекущееСлово = ТекущееСлово + ТекущийСимвол;
				Поз = Поз + 1;
				ТекущийСимвол = Сред(вхСтр, Поз, 1);
			КонецЦикла;
			МассивРезультат.Добавить(Новый Структура("Строка, Цвет", ТекущееСлово + ТекущийСимвол, Цвет_Строка));
			
			ТекущееСлово = "";

		Иначе
			
			ТекущееСлово = ТекущееСлово + ТекущийСимвол;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекущееСлово) Тогда
		МассивРезультат.Добавить(ТекущееСлово);
	КонецЕсли; 

	Возврат МассивРезультат;
	
КонецФункции

Функция форматирование_ЭтоКлючевоеСлово(стрСлово)

	ПроверяемоеСлово = СокрЛП(стрСлово);
	
	СписокКлючевыхСлов = ";IF;ЕСЛИ;THEN;ТОГДА;ELSIF;ИНАЧЕЕСЛИ;ELSE;ИНАЧЕ;ENDIF;КОНЕЦЕСЛИ;DO;ЦИКЛ;FOR;ДЛЯ;TO;ПО;EACH;КАЖДОГО;IN;ИЗ;WHILE;ПОКА;ENDDO;КОНЕЦЦИКЛА;PROCEDURE;ПРОЦЕДУРА;ENDPROCEDURE;КОНЕЦПРОЦЕДУРЫ;FUNCTION;ФУНКЦИЯ;ENDFUNCTION;КОНЕЦФУНКЦИИ;VAR;ПЕРЕМ;EXPORT;ЭКСПОРТ;GOTO;ПЕРЕЙТИ;AND;И;OR;ИЛИ;NOT;НЕ;VAL;ЗНАЧ;BREAK;ПРЕРВАТЬ;CONTINUE;ПРОДОЛЖИТЬ;RETURN;ВОЗВРАТ;TRY;ПОПЫТКА;EXCEPT;ИСКЛЮЧЕНИЕ;ENDTRY;КОНЕЦПОПЫТКИ;RAISE;ВЫЗВАТЬИСКЛЮЧЕНИЕ;FALSE;ЛОЖЬ;TRUE;ИСТИНА;UNDEFINED;НЕОПРЕДЕЛЕНО;NULL;NEW;НОВЫЙ;EXECUTE;ВЫПОЛНИТЬ;";
	Возврат Найти(СписокКлючевыхСлов, ";"+ПроверяемоеСлово+";");
	
КонецФункции

Функция форматирование_ЭтоЧисло(стрСлово)
	
	ЛевСимв = Лев(стрСлово, 1);
	Если ЛевСимв >= "0" и ЛевСимв <= "9" Тогда
		Возврат Истина; 
	КонецЕсли; 
	
	Возврат Ложь; 

КонецФункции
#КонецОбласти

&НаКлиенте
Процедура РаскрашиватьТекст(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ТекстЗапросаПриИзменении(Элемент)
	ТекстЗапроса.УстановитьФорматированнуюСтроку(ПолучитьРаскрашенныйТекст(ТекстЗапроса.ПолучитьТекст()));
КонецПроцедуры
